app/controllers/stories_controller.rb

  def index
    @stories = Story.order(:order).all
---
SELECT "stories".* FROM "stories" ORDER BY "stories"."order" ASC