app/models/story.rb

SELECT  1 AS one FROM "stories" LIMIT $1  [["LIMIT", 1]]
SELECT  "stories".* FROM "stories" ORDER BY stories.id desc LIMIT $1 OFFSET $2  [["LIMIT", 20], ["OFFSET", 0]]
SELECT  "stories".* FROM "stories" ORDER BY "stories"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  after_save { media.purge if remove_media == "1" }

  after_initialize do
    if new_record? && Story.exists?
      self.order ||= Story.last.order + 1
    else
      self.order = 1